name: "macondo-nn"
platform: "onnxruntime_onnx"
max_batch_size: 128
input [
  {
    name: "board"
    data_type: TYPE_FP32
    dims: [ 84, 15, 15 ]
  },
  {
    name: "scalars"
    data_type: TYPE_FP32
    dims: [ 66 ]
  }
]
output [
  {
    name: "win_pred"
    data_type: TYPE_FP32
    dims: [1]
    reshape { shape: [] }
  }
]
version_policy {
  all { }
}