name: "macondo-nn"
platform: "tensorrt_plan"
max_batch_size: 0
input [
  {
    name: "board"
    data_type: TYPE_FP32
    dims: [ -1, 85, 15, 15 ]
  },
  {
    name: "scalars"
    data_type: TYPE_FP32
    dims: [ -1, 72 ]
  }
]
output [
  {
    name: "value"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]
optimization {
  execution_accelerators {
    gpu_execution_accelerator : [ { name : "tensorrt" } ]
  }
}